{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "BertNormalizer",
    "clean_text": false,
    "handle_chinese_chars": true,
    "strip_accents": null,
    "lowercase": true
  },
  "pre_tokenizer": {
    "type": "WhitespaceSplit"
  },
  "post_processor": {
    "type": "BertProcessing",
    "sep": [
      "[CLS]",
      2
    ],
    "cls": [
      "[SEP]",
      3
    ]
  },
  "decoder": {
    "type": "WordPiece",
    "prefix": "##",
    "cleanup": true
  },
  "model": {
    "type": "WordPiece",
    "unk_token": "[UNK]",
    "continuing_subword_prefix": "##",
    "max_input_chars_per_word": 100,
    "vocab": {
      "[PAD]": 0,
      "[UNK]": 1,
      "[CLS]": 2,
      "[SEP]": 3,
      "\u0001": 4,
      "\u0005": 5,
      "\u0006": 6,
      "\u0007": 7,
      "!": 8,
      "\"": 9,
      "#": 10,
      "$": 11,
      "%": 12,
      "&": 13,
      "'": 14,
      "(": 15,
      ")": 16,
      "*": 17,
      "+": 18,
      ",": 19,
      "-": 20,
      ".": 21,
      "/": 22,
      "0": 23,
      "1": 24,
      "2": 25,
      "3": 26,
      "4": 27,
      "5": 28,
      "6": 29,
      "7": 30,
      "8": 31,
      "9": 32,
      ":": 33,
      ";": 34,
      "<": 35,
      "=": 36,
      ">": 37,
      "?": 38,
      "@": 39,
      "[": 40,
      "\\": 41,
      "]": 42,
      "^": 43,
      "_": 44,
      "`": 45,
      "a": 46,
      "b": 47,
      "c": 48,
      "d": 49,
      "e": 50,
      "f": 51,
      "g": 52,
      "h": 53,
      "i": 54,
      "j": 55,
      "k": 56,
      "l": 57,
      "m": 58,
      "n": 59,
      "o": 60,
      "p": 61,
      "q": 62,
      "r": 63,
      "s": 64,
      "t": 65,
      "u": 66,
      "v": 67,
      "w": 68,
      "x": 69,
      "y": 70,
      "z": 71,
      "{": 72,
      "|": 73,
      "}": 74,
      "~": 75,
      "ð": 76,
      "׋": 77,
      "の": 78,
      "上": 79,
      "分": 80,
      "数": 81,
      "点": 82,
      "線": 83,
      "##5": 84,
      "##0": 85,
      "##3": 86,
      "##.": 87,
      "##2": 88,
      "##f": 89,
      "##\\": 90,
      "##n": 91,
      "##d": 92,
      "##9": 93,
      "##%": 94,
      "##*": 95,
      "##7": 96,
      "##x": 97,
      "##e": 98,
      "##t": 99,
      "##i": 100,
      "##u": 101,
      "##m": 102,
      "##a": 103,
      "##+": 104,
      "##)": 105,
      "##l": 106,
      "##o": 107,
      "##w": 108,
      "##1": 109,
      "##6": 110,
      "##8": 111,
      "##4": 112,
      "##r": 113,
      "##s": 114,
      "##c": 115,
      "##b": 116,
      "##g": 117,
      "##k": 118,
      "##h": 119,
      "##-": 120,
      "##>": 121,
      "##]": 122,
      "##q": 123,
      "##p": 124,
      "##y": 125,
      "##;": 126,
      "##'": 127,
      "##/": 128,
      "##(": 129,
      "##\"": 130,
      "##,": 131,
      "##j": 132,
      "##~": 133,
      "##v": 134,
      "##z": 135,
      "##[": 136,
      "##^": 137,
      "##?": 138,
      "##_": 139,
      "##|": 140,
      "##$": 141,
      "##`": 142,
      "##:": 143,
      "##=": 144,
      "##!": 145,
      "##<": 146,
      "##&": 147,
      "###": 148,
      "##@": 149,
      "##{": 150,
      "##\u0001": 151,
      "##\u0006": 152,
      "##\u0007": 153,
      "##ð": 154,
      "##\u0005": 155,
      "id": 156,
      "id1": 157,
      "id2": 158,
      "id3": 159,
      "id4": 160,
      "##nt": 161,
      "id5": 162,
      "id0": 163,
      "int": 164,
      "id6": 165,
      "id7": 166,
      "id8": 167,
      "++": 168,
      "##\\n": 169,
      "id9": 170,
      "if": 171,
      "##or": 172,
      "for": 173,
      "id10": 174,
      "##et": 175,
      "##1\\n": 176,
      "##1\\n-": 177,
      "##1\\n-1\\n-": 178,
      "id11": 179,
      "##00": 180,
      "id15": 181,
      "id14": 182,
      "##rn": 183,
      "ret": 184,
      "##urn": 185,
      "return": 186,
      "id12": 187,
      "id16": 188,
      "id13": 189,
      "##on": 190,
      "id17": 191,
      "id18": 192,
      "##ong": 193,
      "long": 194,
      "%d": 195,
      "//": 196,
      "id19": 197,
      "id21": 198,
      "==": 199,
      "id20": 200,
      "##1\\n-1\\n-1\\n-1\\n-": 201,
      "id22": 202,
      "->": 203,
      "##le": 204,
      "##an": 205,
      "##de": 206,
      "id23": 207,
      "##can": 208,
      "##canf": 209,
      "scanf": 210,
      "id24": 211,
      "id26": 212,
      "##lu": 213,
      "id25": 214,
      "##nc": 215,
      "inc": 216,
      "##lude": 217,
      "include": 218,
      "id27": 219,
      "##int": 220,
      "pr": 221,
      "##intf": 222,
      "printf": 223,
      "##in": 224,
      "id31": 225,
      "id28": 226,
      "id30": 227,
      "id29": 228,
      "id32": 229,
      "<=": 230,
      "##oi": 231,
      "id33": 232,
      "voi": 233,
      "void": 234,
      "##se": 235,
      "##lse": 236,
      "else": 237,
      "##ha": 238,
      "&&": 239,
      "##hi": 240,
      "##har": 241,
      "whi": 242,
      "while": 243,
      "##ine": 244,
      "+=": 245,
      "de": 246,
      "def": 247,
      "define": 248,
      "##1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-": 249,
      "id35": 250,
      "id37": 251,
      "--": 252,
      "##0000": 253,
      "char": 254,
      "id36": 255,
      "id34": 256,
      "do": 257,
      "##%d": 258,
      "id38": 259,
      "##ble": 260,
      "id39": 261,
      "id53": 262,
      "10": 263,
      "##ll": 264,
      "##uble": 265,
      "double": 266,
      "id40": 267,
      ">=": 268,
      "si": 269,
      "<<": 270,
      "##of": 271,
      "##ze": 272,
      "size": 273,
      "sizeof": 274,
      "id41": 275,
      "st": 276,
      "id42": 277,
      "id43": 278,
      "id49": 279,
      "id44": 280,
      "!=": 281,
      "str": 282,
      "id50": 283,
      "##st": 284,
      "##10": 285,
      "id48": 286,
      "con": 287,
      "const": 288,
      "%d\\n": 289,
      "id58": 290,
      "id55": 291,
      "id47": 292,
      "id52": 293,
      "##1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-": 294,
      "id56": 295,
      "100": 296,
      "id46": 297,
      "id54": 298,
      "||": 299,
      "id45": 300,
      "%d%d": 301,
      "##lld": 302,
      "id60": 303,
      "##ut": 304,
      "id51": 305,
      "put": 306,
      "##def": 307,
      "##re": 308,
      "##pe": 309,
      "##ype": 310,
      "type": 311,
      "typedef": 312,
      "##ct": 313,
      "%lld": 314,
      "##uct": 315,
      "struct": 316,
      "10000": 317,
      "id63": 318,
      "##em": 319,
      "mem": 320,
      "id59": 321,
      "##ak": 322,
      "bre": 323,
      "break": 324,
      "id57": 325,
      "id61": 326,
      "co": 327,
      "puts": 328,
      "id67": 329,
      "##ue": 330,
      "##ntin": 331,
      "contin": 332,
      "continue": 333,
      "##oc": 334,
      "##all": 335,
      "##alloc": 336,
      "##010": 337,
      "id89": 338,
      "id62": 339,
      "##set": 340,
      "memset": 341,
      "-=": 342,
      "id65": 343,
      "##1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-": 344,
      "0x": 345,
      "id77": 346,
      "id82": 347,
      "id76": 348,
      "%s": 349,
      "id69": 350,
      "malloc": 351,
      "##ort": 352,
      ">>": 353,
      "id68": 354,
      "id85": 355,
      "id66": 356,
      "id72": 357,
      "id64": 358,
      "id90": 359,
      "id79": 360,
      "qs": 361,
      "id70": 362,
      "qsort": 363,
      "*=": 364,
      "id91": 365,
      "%l": 366,
      "%d%d%d": 367,
      "##char": 368,
      "100010": 369,
      "id80": 370,
      "0xf": 371,
      "20": 372,
      "%lld\\n": 373,
      "##ets": 374,
      "id78": 375,
      "id84": 376,
      "##mp": 377,
      "1e": 378,
      "##99": 379,
      "200": 380,
      "id92": 381,
      "strc": 382,
      "id74": 383,
      "*/": 384,
      "/*": 385,
      "id116": 386,
      "##bs": 387,
      "id103": 388,
      "##1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-": 389,
      "20000": 390,
      "id71": 391,
      "id88": 392,
      "%=": 393,
      "no": 394,
      "id83": 395,
      "12": 396,
      "id87": 397,
      "\\n": 398,
      "id108": 399,
      "##es": 400,
      "id148": 401,
      "strcmp": 402,
      "fg": 403,
      "id73": 404,
      "fgets": 405,
      "yes": 406,
      "id81": 407,
      "id97": 408,
      "##it": 409,
      "%ld": 410,
      "100000000": 411,
      "##%lld": 412,
      "30": 413,
      "##24": 414,
      "1000": 415,
      "##ff": 416,
      "50": 417,
      "11": 418,
      "id75": 419,
      "id115": 420,
      "##lf": 421,
      "##di": 422,
      "putchar": 423,
      "##at": 424,
      "id98": 425,
      "16": 426,
      "##ed": 427,
      "id109": 428,
      "id93": 429,
      "id105": 430,
      "%.": 431,
      "##py": 432,
      "##000": 433,
      "id155": 434,
      "##ned": 435,
      "##si": 436,
      "^=": 437,
      "##gned": 438,
      "32": 439,
      "##len": 440,
      "strlen": 441,
      "get": 442,
      "getchar": 443,
      "en": 444,
      "id107": 445,
      "ex": 446,
      "id150": 447,
      "|=": 448,
      "memc": 449,
      "id96": 450,
      "##dif": 451,
      "endif": 452,
      "id141": 453,
      "99": 454,
      "exit": 455,
      "fa": 456,
      "un": 457,
      "id86": 458,
      "101": 459,
      "id104": 460,
      "id110": 461,
      "calloc": 462,
      "id159": 463,
      "id113": 464,
      "id153": 465,
      "id146": 466,
      "15": 467,
      "25": 468,
      "abs": 469,
      "fabs": 470,
      "id151": 471,
      "##1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-": 472,
      "##53": 473,
      "1000000007": 474,
      "##43": 475,
      "id142": 476,
      "40": 477,
      "id95": 478,
      "id149": 479,
      "26": 480,
      "id144": 481,
      "id160": 482,
      "1e9": 483,
      "13": 484,
      "memcpy": 485,
      "##signed": 486,
      "unsigned": 487,
      "##14": 488,
      "##%d%d": 489,
      "200010": 490,
      "id167": 491,
      "##ow": 492,
      "id112": 493,
      "110": 494,
      "51": 495,
      "%lld%lld": 496,
      "100000": 497,
      "60": 498,
      "##ati": 499,
      "id94": 500,
      "##ree": 501,
      "##to": 502,
      "id140": 503,
      "102": 504,
      "1010": 505,
      "free": 506,
      "##%s": 507,
      "999": 508,
      "17": 509,
      "ca": 510,
      "id145": 511,
      "100001": 512,
      "go": 513,
      "pow": 514,
      "id122": 515,
      "case": 516,
      "id114": 517,
      "goto": 518,
      "##%lf": 519,
      "id106": 520,
      "300": 521,
      "500": 522,
      "##f\\n": 523,
      "gets": 524,
      "##rt": 525,
      "id147": 526,
      "id119": 527,
      "##sh": 528,
      "id99": 529,
      "sq": 530,
      "##.0": 531,
      "##15": 532,
      "stati": 533,
      "sqrt": 534,
      "static": 535,
      "id100": 536,
      "id157": 537,
      "ff": 538,
      "##88": 539,
      "##lush": 540,
      "fflush": 541,
      "31": 542,
      "##55": 543,
      "id163": 544,
      "sh": 545,
      "##33": 546,
      "id123": 547,
      "id125": 548,
      "id127": 549,
      "1001": 550,
      "short": 551,
      "id111": 552,
      "id152": 553,
      "%d%d%d%d": 554,
      "id172": 555,
      "105": 556,
      "22": 557,
      "##*d": 558,
      "%c": 559,
      "##288": 560,
      "id120": 561,
      "id175": 562,
      "##1010": 563,
      "18": 564,
      "524": 565,
      "##19": 566,
      "100005": 567,
      "##%l": 568,
      "id156": 569,
      "%lf": 570,
      "524288": 571,
      "21": 572,
      "at": 573,
      "id143": 574,
      "##79": 575,
      "id117": 576,
      "##lf\\n": 577,
      "is": 578,
      "id162": 579,
      "1e-": 580,
      "48": 581,
      "##23": 582,
      "id158": 583,
      "id161": 584,
      "200001": 585,
      "##26": 586,
      ">>=": 587,
      "##1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-": 588,
      "id118": 589,
      "1002": 590,
      "id137": 591,
      "##%ld": 592,
      "id168": 593,
      "id134": 594,
      "200000000": 595,
      "100002": 596,
      "52": 597,
      "##48": 598,
      "##ffff": 599,
      "53": 600,
      "30000": 601,
      "##76": 602,
      "id164": 603,
      "998": 604,
      "14": 605,
      "id102": 606,
      "id136": 607,
      "##os": 608,
      "id138": 609,
      "%*d": 610,
      "-1": 611,
      "##18": 612,
      "id126": 613,
      "27": 614,
      "id174": 615,
      "64": 616,
      "##er": 617,
      "##89": 618,
      "1000000": 619,
      "##2443": 620,
      "atoi": 621,
      "9982443": 622,
      "998244353": 623,
      "##84": 624,
      "id121": 625,
      "1024": 626,
      "##lo": 627,
      "200000": 628,
      "id129": 629,
      "id101": 630,
      "2000": 631,
      "400": 632,
      "<<=": 633,
      "41": 634,
      "%s\\n": 635,
      "24": 636,
      "36": 637,
      "##..": 638,
      "##me": 639,
      "id165": 640,
      "%d%": 641,
      "##50": 642,
      "##1415": 643,
      "##%lf%lf": 644,
      "##14159": 645,
      "3.": 646,
      "sin": 647,
      "##and": 648,
      "0.": 649,
      "19": 650,
      "line": 651,
      "id133": 652,
      "id132": 653,
      "##1415926": 654,
      "flo": 655,
      "##20": 656,
      "3.1415926": 657,
      "ifdef": 658,
      "id128": 659,
      "id139": 660,
      "cos": 661,
      "%llu": 662,
      "256": 663,
      "##535": 664,
      "5000": 665,
      "##0f": 666,
      "##64": 667,
      "3.1415926535": 668,
      "##30": 669,
      "##323": 670,
      "3.141592653589": 671,
      "##3f": 672,
      "strcpy": 673,
      "128": 674,
      "3.14159265358979": 675,
      "id124": 676,
      "signed": 677,
      "%ld\\n": 678,
      "##sible": 679,
      "%lld%lld%lld": 680,
      "##ossible": 681,
      "3.14159265358979323": 682,
      "&=": 683,
      "50000": 684,
      "##git": 685,
      "id131": 686,
      "%d%d%d%d%d": 687,
      "no\\n": 688,
      "##digit": 689,
      "isdigit": 690,
      "3.1415926535897932384": 691,
      "1000000000": 692,
      "1.0": 693,
      "42": 694,
      "##9999": 695,
      "-1\\n": 696,
      "3000": 697,
      "##aa": 698,
      "##45": 699,
      "%s%s": 700,
      "re": 701,
      "##66": 702,
      "103": 703,
      "1000010": 704,
      "501": 705,
      "float": 706,
      "75": 707,
      "##ime": 708,
      "##cc": 709,
      "%d:": 710,
      "107": 711,
      "%ld%ld": 712,
      "%.9": 713,
      "55": 714,
      "62": 715,
      "202": 716,
      "##1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-": 717,
      "rand": 718,
      "##36": 719,
      "##ma": 720,
      "##12": 721,
      "##0f0f": 722,
      "65": 723,
      "?:": 724,
      "na": 725,
      "##21": 726,
      "id130": 727,
      "%d%s": 728,
      "##%d\\n": 729,
      "10010": 730,
      "2002": 731,
      "##5555": 732,
      "%f\\n": 733,
      "\\0": 734,
      "##576": 735,
      "##11": 736,
      "1e-8": 737,
      "%f": 738,
      "33": 739,
      "time": 740,
      "id169": 741,
      "##00000000": 742,
      "imp": 743,
      "##%f": 744,
      "##83": 745,
      "id135": 746,
      "1048": 747,
      "yes\\n": 748,
      "9999": 749,
      "impossible": 750,
      "210": 751,
      "97": 752,
      "##xx": 753,
      "##ei": 754,
      "##ag": 755,
      "##wi": 756,
      "##ch": 757,
      "1005": 758,
      "##3f3f": 759,
      "0\\n": 760,
      "2e": 761,
      "35": 762,
      "%d%c": 763,
      "realloc": 764,
      "in": 765,
      "##scanf": 766,
      "##pr": 767,
      "prag": 768,
      "0x7": 769,
      "memcmp": 770,
      "3005": 771,
      "1048576": 772,
      "pragma": 773,
      "##po": 774,
      "id154": 775,
      "-wi": 776,
      "1\\n": 777,
      "sscanf": 778,
      "##\\0": 779,
      "##type": 780,
      "##omp": 781,
      "##-po": 782,
      "##-type": 783,
      "##ncomp": 784,
      "##inter": 785,
      "##ble-po": 786,
      "2005": 787,
      "##atible-po": 788,
      "2000000007": 789,
      "2000000000000": 790,
      "-wincomp": 791,
      "##-types": 792,
      "##inter-types": 793,
      "##atible-pointer-types": 794,
      "-wincompatible-pointer-types": 795,
      "0.0": 796,
      "90": 797,
      "cei": 798,
      "##al": 799,
      "##41": 800,
      "id173": 801,
      "%d,": 802,
      "1e18": 803,
      "2000010": 804,
      "0.5": 805,
      "29": 806,
      "2010": 807,
      "##29": 808,
      "##4364": 809,
      "512": 810,
      "5001": 811,
      "##3333": 812,
      "##10101010": 813,
      "##364364": 814,
      "ceil": 815,
      "3010": 816,
      "49": 817,
      "40000": 818,
      "5010": 819,
      "80": 820,
      "##ve": 821,
      "##str": 822,
      "%s%d": 823,
      "10001": 824,
      "##433": 825,
      "##1919": 826,
      "415": 827,
      "57": 828,
      "##514": 829,
      "##ac": 830,
      "id166": 831,
      "id177": 832,
      "##101919": 833,
      "10005": 834,
      "10002": 835,
      "##14514": 836,
      "%lf%lf%lf": 837,
      "atan": 838,
      "##18101919": 839,
      "10721": 840,
      "0x7ffff": 841,
      "##4118101919": 842,
      "4154118101919": 843,
      "1072114514": 844,
      "4154118101919364364": 845,
      "4000": 846,
      "id171": 847,
      "2001": 848,
      "409": 849,
      "300000": 850,
      "##printf": 851,
      "sw": 852,
      "##25": 853,
      "##hr": 854,
      "##00ff": 855,
      "##itch": 856,
      "%.12": 857,
      "400010": 858,
      "switch": 859,
      "23": 860,
      "28": 861,
      "sprintf": 862,
      "##01": 863,
      "##67": 864,
      "##001": 865,
      "strstr": 866,
      "0x10101010": 867,
      "%lf\\n": 868,
      "1e8": 869,
      "strchr": 870,
      "200005": 871,
      "##795": 872,
      "##3030": 873,
      "atan2": 874,
      "0x7ffffff": 875,
      "37": 876,
      "310": 877,
      "600": 878,
      "ac": 879,
      "##02": 880,
      "##07": 881,
      "##17": 882,
      "##626": 883,
      "##--": 884,
      "10000000": 885,
      "200002": 886,
      "3.1415926535897932384626": 887,
      "%.9f\\n": 888,
      "##832": 889,
      "##433832": 890,
      "3.1415926535897932384626433832": 891,
      "ab": 892,
      "##%c": 893,
      "##ic": 894,
      "##mo": 895,
      "0xff": 896,
      "301": 897,
      "%.8": 898,
      "%.10": 899,
      "99999": 900,
      "2e9": 901,
      "2.0": 902,
      "510": 903,
      "##77": 904,
      "##ou": 905,
      "##[^": 906,
      "####": 907,
      "205": 908,
      "111": 909,
      "%ld%ld%ld": 910,
      "##1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-": 911,
      "70": 912,
      "##40": 913,
      "##%d]": 914,
      "memmo": 915,
      "%.15": 916,
      "5005": 917,
      "500010": 918,
      "360": 919,
      "%.12lf\\n": 920,
      "acos": 921,
      "memmove": 922,
      "38": 923,
      "333": 924,
      "sr": 925,
      "##ir": 926,
      "##ab": 927,
      "##rr": 928,
      "##00000": 929,
      "%d%d\\n": 930,
      "2048": 931,
      "strcat": 932,
      "##144": 933,
      "##%f%f": 934,
      "0x7fffffff": 935,
      "%.8lf\\n": 936,
      "45": 937,
      "sy": 938,
      "tan": 939,
      "##2144": 940,
      "##sp": 941,
      "##pha": 942,
      "##007": 943,
      "1e6": 944,
      "%.f": 945,
      "262144": 946,
      "##%llu": 947,
      "isal": 948,
      "1e-7": 949,
      "%*d%d": 950,
      "na\\n": 951,
      "2000000000000007": 952,
      "srand": 953,
      "isalpha": 954,
      "1.": 955,
      "4010": 956,
      "419": 957,
      "err": 958,
      "ok": 959,
      "##06": 960,
      "##04": 961,
      "##*c": 962,
      "108": 963,
      "##stem": 964,
      "0x010": 965,
      "1e4": 966,
      "303": 967,
      "%lf%lf": 968,
      "##768": 969,
      "%*d%d%d": 970,
      "%d%d%d%d%d%d": 971,
      "##aaaa": 972,
      "##6666": 973,
      "##cccc": 974,
      "%.10lf\\n": 975,
      "system": 976,
      "error": 977,
      "di": 978,
      "##57": 979,
      "##%*d": 980,
      "##e4": 981,
      "##put": 982,
      "id179": 983,
      "0x9": 984,
      "201": 985,
      "123": 986,
      "##%lld%lld": 987,
      "255": 988,
      "##536": 989,
      "1000001": 990,
      "3001": 991,
      "##10101": 992,
      "issp": 993,
      "%d%*d": 994,
      "##ace": 995,
      "3.1415926535897932384626433832795": 996,
      "41943": 997,
      "0x01010101": 998,
      "isspace": 999,
      "%u": 1000,
      "39": 1001,
      "46": 1002,
      "44": 1003,
      "73": 1004,
      "700": 1005,
      "800": 1006,
      "96": 1007,
      "ng": 1008,
      "possible": 1009,
      "tr": 1010,
      "~~": 1011,
      "##03": 1012,
      "##ec": 1013,
      "##1d": 1014,
      "##80": 1015,
      "##ht": 1016,
      "##yy": 1017,
      "##rnc": 1018,
      "##%d,": 1019,
      "strnc": 1020,
      "strto": 1021,
      "##ock": 1022,
      "2019": 1023,
      "1e10": 1024,
      "1145": 1025,
      "%.6": 1026,
      "1e-6": 1027,
      "##2345": 1028,
      "##5050": 1029,
      "##0f0f0f0f": 1030,
      "65536": 1031,
      "##55555555": 1032,
      "##xxxx": 1033,
      "##3f3f3f3f": 1034,
      "%lf%lf%lf%lf": 1035,
      "##00ff00ff": 1036,
      "114514": 1037,
      "56": 1038,
      "63": 1039,
      "61": 1040,
      "72": 1041,
      "al": 1042,
      "##22": 1043,
      "##af": 1044,
      "##lock": 1045,
      "##oo": 1046,
      "##16": 1047,
      "##\\n]": 1048,
      "##%d:": 1049,
      "%d\\n%d\\n": 1050,
      "1e3": 1051,
      "1111": 1052,
      "300010": 1053,
      "500000": 1054,
      "500001": 1055,
      "334": 1056,
      "4096": 1057,
      "3333": 1058,
      "%[^": 1059,
      "43": 1060,
      "[%d]": 1061,
      "fput": 1062,
      "ov": 1063,
      "th": 1064,
      "##d\\n": 1065,
      "##*s": 1066,
      "##ig": 1067,
      "##ul": 1068,
      "##ar": 1069,
      "##line": 1070,
      "##69": 1071,
      "##,%f": 1072,
      "id170": 1073,
      "##per": 1074,
      "100003": 1075,
      "%s%d%d": 1076,
      "%.f\\n": 1077,
      "##0001": 1078,
      "exp": 1079,
      "150": 1080,
      "404": 1081,
      "9999999": 1082,
      "180": 1083,
      "300005": 1084,
      "floor": 1085,
      "400001": 1086,
      "40002": 1087,
      "%.15f": 1088,
      "over": 1089,
      "%1d": 1090,
      "34": 1091,
      "59": 1092,
      "58": 1093,
      "54": 1094,
      "clock": 1095,
      "lo": 1096,
      "##\\\"": 1097,
      "##no": 1098,
      "##um": 1099,
      "##able": 1100,
      "##81": 1101,
      "##pper": 1102,
      "##\\n0": 1103,
      "%d%lld": 1104,
      "1003": 1105,
      "1e5": 1106,
      "120": 1107,
      "505": 1108,
      "##0007": 1109,
      "32768": 1110,
      "1000005": 1111,
      "220": 1112,
      "##....": 1113,
      "%llu\\n": 1114,
      "%llu%llu": 1115,
      "%d%d%d%d%d%d%d": 1116,
      "##99999999": 1117,
      "%s%s%s": 1118,
      "%.9f": 1119,
      "impossible\\n": 1120,
      "20000000000000007": 1121,
      "805": 1122,
      "4097": 1123,
      "##irst": 1124,
      "strtok": 1125,
      "##afe": 1126,
      "##ult": 1127,
      "%*s": 1128,
      "47": 1129,
      "410": 1130,
      "85": 1131,
      "82": 1132,
      "a..": 1133,
      "bo": 1134,
      "first": 1135,
      "ga": 1136,
      "pa": 1137,
      "sec": 1138,
      "##.%d": 1139,
      "##%02": 1140,
      "##72": 1141,
      "##pq": 1142,
      "%d/": 1143,
      "##000000": 1144,
      "##0000ffff": 1145,
      "0x55555555": 1146,
      "0x3f3f3f3f": 1147,
      "##999": 1148,
      "163": 1149,
      "%.5": 1150,
      "%.20": 1151,
      "end": 1152,
      "undef": 1153,
      "402": 1154,
      "##own": 1155,
      "1000003": 1156,
      "##%s%s": 1157,
      "##%lf,": 1158,
      "1e-9": 1159,
      "3000000": 1160,
      "inline": 1161,
      "##33333333": 1162,
      "##ack": 1163,
      "##6789": 1164,
      "abc": 1165,
      "##ice": 1166,
      "######": 1167,
      "##1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-1\\n-": 1168,
      "strncmp": 1169,
      "alice": 1170,
      "secon": 1171,
      "%lu": 1172,
      "555": 1173,
      "6000": 1174,
      "79": 1175,
      "88": 1176,
      "8000": 1177,
      "98": 1178,
      "dr": 1179,
      "la": 1180,
      "safe": 1181,
      "##09": 1182,
      "##.6": 1183,
      "##\\7": 1184,
      "##\\x": 1185,
      "##ndef": 1186,
      "##%*c": 1187,
      "##ey": 1188,
      "##un": 1189,
      "##ai": 1190,
      "##low": 1191,
      "##8b": 1192,
      "##c2": 1193,
      "##ghi": 1194,
      "##yz": 1195,
      "##!\\n": 1196,
      "ifndef": 1197,
      "##llf": 1198,
      "%d\\n%d": 1199,
      "%d%d%s": 1200,
      "##defghi": 1201,
      "0x3030": 1202,
      "1e7": 1203,
      "200009": 1204,
      "10000000000": 1205,
      "305": 1206,
      "502": 1207,
      "112345": 1208,
      "false": 1209,
      "1500": 1210,
      "2500": 1211,
      "1000002": 1212,
      "##7950": 1213,
      "271": 1214,
      "365": 1215,
      "0.00000000": 1216,
      "50002": 1217,
      "%lld%lld%lld%lld": 1218,
      "500100": 1219,
      "3.14159265358979323846264338327950": 1220,
      "4194304": 1221,
      "true": 1222,
      "%[^\\n]": 1223,
      "fputs": 1224,
      "##ight": 1225,
      "game": 1226,
      "16384": 1227,
      "%.5lf\\n": 1228,
      "%.20lf\\n": 1229,
      "labs": 1230,
      "01": 1231,
      "350": 1232,
      "5e": 1233,
      "5e4": 1234,
      "66": 1235,
      "60000": 1236,
      "71": 1237,
      "78": 1238,
      "87": 1239,
      "84": 1240,
      "864": 1241,
      "9e": 1242,
      "\\x": 1243,
      "by": 1244,
      "roo": 1245,
      "win": 1246,
      "##28": 1247,
      "##\\6": 1248,
      "##nown": 1249,
      "##dd": 1250,
      "##%[": 1251,
      "##%.6": 1252,
      "##xyz": 1253,
      "##en": 1254,
      "##el": 1255,
      "##th": 1256,
      "##i=": 1257,
      "##uv": 1258,
      "##mno": 1259,
      "##aw": 1260,
      "##as": 1261,
      "##a..": 1262,
      "##++": 1263,
      "##lmno": 1264,
      "##ok": 1265,
      "##wxyz": 1266,
      "##400": 1267,
      "##rst": 1268,
      "##known": 1269,
      "##klmno": 1270,
      "##jklmno": 1271,
      "##:%d": 1272,
      "id176": 1273,
      "##ing": 1274,
      "109": 1275,
      "104": 1276,
      "stable": 1277,
      "##1072": 1278,
      "100004": 1279,
      "0x0f0f0f0f": 1280,
      "0x00ff00ff": 1281,
      "0x33333333": 1282,
      "1e20": 1283,
      "2003": 1284,
      "node": 1285,
      "127": 1286,
      "10007": 1287,
      "unknown": 1288,
      "15000": 1289,
      "250000": 1290,
      "##4329": 1291,
      "401": 1292,
      "131072": 1293,
      "##%lf)": 1294,
      "5002": 1295,
      "2222": 1296,
      "%c\\n": 1297,
      "%c%d": 1298,
      "1e-10": 1299,
      "##489": 1300,
      "4001": 1301,
      "##649": 1302,
      "30002": 1303,
      "##125": 1304,
      "2e3": 1305,
      "inf": 1306,
      "%d,%d": 1307,
      "501010": 1308,
      "239": 1309,
      "60010": 1310,
      "##174": 1311,
      "##----": 1312,
      "705": 1313,
      "##66666666": 1314,
      "div": 1315,
      "12345": 1316,
      "444": 1317,
      "possible\\n": 1318,
      "log": 1319,
      "bob": 1320,
      "##pqrst": 1321,
      "##%lf,%lf)": 1322,
      "draw": 1323,
      "##defghijklmno": 1324,
      "0x30303030": 1325,
      "\\x8b": 1326,
      "root": 1327,
      "##uvwxyz": 1328,
      "##pqrstuvwxyz": 1329,
      "##defghijklmnopqrstuvwxyz": 1330,
      "%3": 1331,
      "%g": 1332,
      "..": 1333,
      "199": 1334,
      "4.0": 1335,
      "6.": 1336,
      "67": 1337,
      "83": 1338,
      "81": 1339,
      "94": 1340,
      "900": 1341,
      "dat": 1342,
      "fu": 1343,
      "key": 1344,
      "mi": 1345,
      "non": 1346,
      "on": 1347,
      "tou": 1348,
      "##56": 1349,
      "##5\\n": 1350,
      "##0768": 1351,
      "##.29": 1352,
      "##2\\n": 1353,
      "##d:": 1354,
      "##923": 1355,
      "##ea": 1356,
      "##te": 1357,
      "##ub": 1358,
      "##mb": 1359,
      "##ad": 1360,
      "##+\\6": 1361,
      "##);": 1362,
      "##13": 1363,
      "##199": 1364,
      "##49": 1365,
      "##bb": 1366,
      "##-%d": 1367,
      "##[%d]": 1368,
      "##_s": 1369,
      "%d%lf": 1370,
      "%d%ld": 1371,
      "100.0": 1372,
      "##rent": 1373,
      "%lld%d%d": 1374,
      "0x0": 1375,
      "0x1": 1376,
      "20010": 1377,
      "129": 1378,
      "1200000": 1379,
      "\\n%c": 1380,
      "1000000009": 1381,
      "302": 1382,
      "503": 1383,
      "5050": 1384,
      "%.7": 1385,
      "150000": 1386,
      "##5329": 1387,
      "137": 1388,
      "##147": 1389,
      "##%lf\\n": 1390,
      "50010": 1391,
      "1001001": 1392,
      "2000000000": 1393,
      "300001": 1394,
      "##769": 1395,
      "1440": 1396,
      "##lose": 1397,
      "##...": 1398,
      "%d%*c": 1399,
      "0.1": 1400,
      "50003": 1401,
      "%lld%lld%lld%lld%lld": 1402,
      "%.9lf\\n": 1403,
      "##576923": 1404,
      "0.0174": 1405,
      "57.29": 1406,
      "##25199": 1407,
      "100000007": 1408,
      "999999": 1409,
      "##ous": 1410,
      "%ld%ld%ld%ld": 1411,
      "##%f%f%f%f": 1412,
      "%u\\n": 1413,
      "80010": 1414,
      "##%d,%d": 1415,
      "%.6f\\n": 1416,
      "%.6lf\\n": 1417,
      "##xxxxxx": 1418,
      "##690768": 1419,
      "##,%f,%f": 1420,
      "%d%d%d%d%d%d%d%d": 1421,
      "second": 1422,
      "##\\7+\\6": 1423,
      "##lower": 1424,
